export const GOV_PARTY = [
	'ครูไทยเพื่อประชาชน',
	'ชาติไทยพัฒนา',
	'ชาติพัฒนา',
	'ไทยศรีวิไลย์',
	'ไทรักธรรม',
	'ประชาธรรมไทย',
	'ประชาธิปไตยใหม่',
	'ประชาธิปัตย์',
	'ประชานิยม',
	'ประชาภิวัฒน์',
	'พลเมืองไทย',
	'พลังชาติไทย',
	'พลังท้องถิ่นไท',
	'พลังธรรมใหม่',
	'พลังประชารัฐ',
	'เพื่อชาติไทย',
	'ภูมิใจไทย',
	'รวมพลังประชาชาติไทย',
	'รักษ์ผืนป่าประเทศไทย',
	'เศรษฐกิจไทย',
	'เศรษฐกิจใหม่'
] as const;

export const OPP_PARTY = [
	'ก้าวไกล',
	'ประชาชาติ',
	'พลังปวงชนไทย',
	'เพื่อชาติ',
	'เพื่อไทย',
	'เสรีรวมไทย',
	'อนาคตใหม่'
] as const;

// export const ALL_PARTY = [...GOV_PARTY, ...OPP_PARTY].sort((a, z) => a.localeCompare(z));
// TODO: find way to sort later
export const ALL_PARTY = [
	'เพื่อไทย',
	'ภูมิใจไทย',
	'ก้าวไกล',
	'ประชาธิปัตย์',
	'พลังประชารัฐ',
	'เสรีรวมไทย',
	'เพื่อชาติ',
	'ประชาชาติ',
	'ชาติไทยพัฒนา',
	'พลังปวงชนไทย',
	'พลังท้องถิ่นไท',
	'ครูไทยเพื่อประชาชน',
	'ชาติพัฒนา',
	'ไทรักธรรม',
	'ไทยศรีวิไลย์',
	'รักษ์ผืนป่าประเทศไทย',
	'เศรษฐกิจใหม่',
	'ประชาธิปไตยใหม่',
	'พลังชาติไทย',
	'อนาคตใหม่',
	'พลังธรรมใหม่',
	'พลเมืองไทย',
	'เพื่อชาติไทย',
	'ประชาธรรมไทย',
	'เศรษฐกิจไทย',
	'ประชานิยม',
	'ประชาภิวัฒน์',
	'รวมพลังประชาชาติไทย'
];

export type PartyType = typeof ALL_PARTY[number];

export const isParty = (string: string) => {
	return (ALL_PARTY as string[]).includes(string);
};

export const getPartyImage = (party: string) => {
	if (isParty(party)) return `/law-watch/party/${party}.jpg`;
	return '';
};
